{"keras_version": "2.2.4", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"use_bias": true, "padding": "valid", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_1", "filters": 32, "data_format": "channels_last", "batch_input_shape": [null, 28, 28, 1], "bias_regularizer": null, "activation": "relu", "strides": [1, 1], "dtype": "float32", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"use_bias": true, "padding": "valid", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "name": "conv2d_2", "filters": 64, "data_format": "channels_last", "bias_regularizer": null, "activation": "relu", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_1", "seed": null, "trainable": true, "noise_shape": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "units": 128, "activity_regularizer": null, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_2", "seed": null, "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "units": 10, "activity_regularizer": null, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "activation": "softmax", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}]}, "backend": "tensorflow"}